OdDbHandle.bytes(System.Byte*)
\details
Returns the this Handle object as an array OdUInt8[8].
\param bytes [in]  array of bytes to receive the handle.
\remarks
The low order byte is returned in bytes[0].
\remarks
The buffer must be at least 17 bytes long.